{
    "$schema":  "https://aka.ms/winget-packages.schema.2.0.json",
    "CreationDate":  "2026-05-31T01:31:38.915-00:00",
    "Sources":  [
                    {
                        "Packages":  [
                                         {
                                             "PackageIdentifier":  "Docker.DockerDesktop"
                                         },
                                         {
                                             "PackageIdentifier":  "Git.Git"
                                         },
                                         {
                                             "PackageIdentifier":  "GitHub.cli"
                                         },
                                         {
                                             "PackageIdentifier":  "gerardog.gsudo"
                                         },
                                         {
                                             "PackageIdentifier":  "Microsoft.VisualStudio.Community"
                                         },
                                         {
                                             "PackageIdentifier":  "Zellij.Zellij"
                                         },
                                         {
                                             "PackageIdentifier":  "jdx.mise"
                                         },
                                         {
                                             "PackageIdentifier":  "Microsoft.VisualStudioCode"
                                         },
                                         {
                                             "PackageIdentifier":  "Microsoft.WindowsTerminal"
                                         },
                                         {
                                             "PackageIdentifier":  "Microsoft.PowerShell"
                                         },
                                         {
                                             "PackageIdentifier":  "Obsidian.Obsidian"
                                         },
                                         {
                                             "PackageIdentifier":  "AgileBits.1Password.CLI"
                                         },
                                         {
                                             "PackageIdentifier":  "Gyan.FFmpeg"
                                         }
                                     ],
                        "SourceDetails":  {
                                              "Argument":  "https://cdn.winget.microsoft.com/cache",
                                              "Identifier":  "Microsoft.Winget.Source_8wekyb3d8bbwe",
                                              "Name":  "winget",
                                              "Type":  "Microsoft.PreIndexed.Package"
                                          }
                    },
                    {
                        "Packages":  [
                                         {
                                             "PackageIdentifier":  "9WZDNCRDK3WP"
                                         }
                                     ],
                        "SourceDetails":  {
                                              "Argument":  "https://storeedgefd.dsx.mp.microsoft.com/v9.0",
                                              "Identifier":  "StoreEdgeFD",
                                              "Name":  "msstore",
                                              "Type":  "Microsoft.Rest"
                                          }
                    }
                ],
    "WinGetVersion":  "1.28.240"
}
